/**************************************************************************************************************************/
  ------------------- 适用于订单、出货单、调拨单、退货单、损毁单、盘点单和批次入库单编号的序列---------------------------
  ----针对表 SALE_AGENCY_RECEIPT (订单)的AR_NO字段创建同一序列函数
  ----add by 陈震: 2015/9/22
/**************************************************************************************************************************/
CREATE OR REPLACE FUNCTION f_get_sale_ar_seq
   RETURN VARCHAR2 IS
BEGIN
   return 'AR'||lpad(seq_order_no.nextval,8,'0');
END;
