create or replace type tabletype as table of varchar2(32676)
/*********************************************************************/
------------ 数组定义: table函数返回值   -------------
/*********************************************************************/
/
create or replace type type_game_auth_info is object
/*********************************************************************/
------------ add by dzg 适用于: 批量插入站点授权游戏信息  ---------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  agencycode              varchar(8),          --站点编号
  plancode                varchar(10),         --区域或者销售站编码
  salecommissionrate      number(8),           --销售代销费比率
  paycommissionrate       number(8)            --兑奖代销费比率

);
/

create or replace type type_game_auth_list as table of type_game_auth_info;
/*********************************************************************/
------------ 适用于: 批量插入游戏授权，入口参数实体数组定义   -------------
/*********************************************************************/
/

create or replace type type_lottery_info as object
/*********************************************************************/
------------ 适用于: 批量入库的彩票对象   ----------------
------------ add by 陈震 2015/9/17        ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code	   varchar2(10),         -- 方案编码
  batch_no	   varchar2(10),         -- 批次
  valid_number number(1),            -- 有效位数（1-箱号、2-盒号、3-本号）
  trunk_no     varchar2(10),         -- 箱号
  box_no       varchar2(20),         -- 开始盒号（箱号+盒子顺序号）
  box_no_e     varchar2(20),         -- 结束盒号（箱号+盒子顺序号）
  package_no   varchar2(10),         -- 开始本号（当有效位数是箱和盒时，此为首本号）
  package_no_e varchar2(10),         -- 结束本号（当有效位数是箱和盒时，此为末本号）
  reward_group number(2)             -- 奖组
);
/

create or replace type type_lottery_list as table of type_lottery_info
/*********************************************************************/
------------ 数组定义: 用于记录扫描入库的彩票对象   -------------
/*********************************************************************/
/

create or replace type type_logistics_info is object
/*********************************************************************/
------------ 适用于: 物流查询   ----------------
------------ add by 陈震 2015/9/22        ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  ttime	         date,              -- 变化时间
  obj_type	      number(2),         -- 出入库类型（入库类型=入库类型+10）
  obj_object_s    varchar2(4000),       -- 仓库
  obj_object_t    varchar2(4000)        -- 人员
);
/

create or replace type type_logistics_list as table of type_logistics_info
/*********************************************************************/
------------ 数组定义: 用于记录彩票的物流信息   -------------
/*********************************************************************/
/

create or replace type type_lottery_detail_info is object
/*********************************************************************/
------------ 适用于: 出入库明细处理的存储过程   ----------------
------------ add by 陈震 2015/9/25        ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code       varchar2(10),        -- 方案编码
  batch_no        varchar2(10),        -- 批次
  valid_number    number(1),           -- 有效位数（1-箱号、2-盒号、3-本号）
  trunk_no        varchar2(10),        -- 箱号
  box_no          varchar2(20),        -- 盒号（箱号+盒子顺序号）
  package_no      varchar2(10),        -- 本号
  tickets         number(18),          -- 票数
  amount          number(28)           -- 金额
);
/

create or replace type type_lottery_detail_list as table of type_lottery_detail_info
/*****************************************************************************/
------------ 数组定义: 用于记录即将被保存的彩票入库或者出库明细   -------------
/*****************************************************************************/
/

create or replace type type_lottery_statistics_info is object
/******************************************************************************/
------------ 适用于: 按照方案和批次统计出入库明细的票数和金额   ----------------
------------ add by 陈震 2015/9/25        ----------------
/******************************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code       varchar2(10),        -- 方案编码
  batch_no        varchar2(10),        -- 批次
  tickets         number(18),          -- 票数
  amount          number(28),          -- 金额
  trunks          number(10),          -- 箱数
  boxes           number(10),          -- 盒数
  packages        number(10)           -- 本数
);
/

create or replace type type_lottery_statistics_list as table of type_lottery_statistics_info
/***************************************************************************************/
------------ 数组定义: 用于按方案和批次记录出入库明细中所包含的票数和金额   -------------
/***************************************************************************************/
/

create or replace type type_item_info is object
/******************************************************************************/
------------ 适用于: 物品出入库明细   ----------------
------------ add by 陈震 2015/10/13        ----------------
/******************************************************************************/
(
  -----------    实体字段定义    -----------------
  item_code	char(8),                   -- 物品编码（IT123456）
  quantity	number(10)                 -- 数量
);
/

create or replace type type_item_list as table of type_item_info
/***************************************************************************************/
------------ 数组定义: 用于物品出入库明细   -------------
/***************************************************************************************/
/


create or replace type type_lottery_import_err_info as object
/*********************************************************************/
------------ 适用于: 批量入库的彩票对象错误信息   ----------------
------------ add by 陈震 2015/9/17        ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code	   varchar2(10),         -- 方案编码
  batch_no	   varchar2(10),         -- 批次
  err_code     number(10),           -- 不能入库的错误提示编号
  err_msg      varchar2(20000)       -- 不能入库的错误提示信息
);
/

create or replace type type_lottery_import_err_list as table of type_lottery_import_err_info
/*********************************************************************/
------------ 数组定义: 用于记录扫描入库的彩票对象   -------------
/*********************************************************************/
/

create or replace type type_lottery_reward_info as object
/*********************************************************************/
------------ 适用于: 批量入库的彩票对象错误信息   ----------------
------------ add by 陈震 2015/9/17        ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code       varchar2(10),        -- 方案编码
  batch_no        varchar2(10),        -- 批次
  package_no      varchar2(10),        -- 本号
  ticket_no       number(5),           -- 票号
  security_code   VARCHAR2(50)         -- 安全码
);
/

create or replace type type_lottery_reward_list as table of type_lottery_reward_info
/*********************************************************************/
------------ 数组定义: 用于记录扫描入库的彩票对象   -------------
/*********************************************************************/
/

create or replace type type_mm_check_lottery_info as object
/*********************************************************************/
------------ 适用于: 管理员库存盘点的彩票对象   ----------------
------------ add by 陈震 2015-12-08             ----------------
/*********************************************************************/
(
  -----------    实体字段定义    -----------------
  plan_code	   varchar2(10),         -- 方案编码
  batch_no	   varchar2(10),         -- 批次
  valid_number number(1),            -- 有效位数（1-箱号、2-盒号、3-本号）
  trunk_no     varchar2(10),         -- 箱号
  box_no       varchar2(20),         -- 盒号（结构用于验奖程序时，此字段用于显示中奖金额）
  package_no   varchar2(10),         -- 本号
  tickets      number(28),           -- 张数
  status       number(1)             -- 管理员彩票库存状态（1-不在库、2-未扫描）
);
/

create or replace type type_mm_check_lottery_list as table of type_mm_check_lottery_info
/*********************************************************************/
------------ 数组定义: 管理员库存盘点的彩票对象   -------------
/*********************************************************************/
/