/**************************************************************************************************************************/
  ------------------- 适用于订单、出货单、调拨单、退货单、损毁单、盘点单和批次入库单编号的序列---------------------------
  ----针对表 批次终结（WH_BATCH_END） 的BE_NO字段创建序列函数
  ----add by 陈震: 2015/9/21
/**************************************************************************************************************************/
CREATE OR REPLACE FUNCTION f_get_wh_batch_end_seq
   RETURN VARCHAR2 IS
BEGIN
   return 'ZJ'||lpad(seq_order_no.nextval,8,'0');
END;
