/**************************************************************************************************************************/
  ------------------- 适用于订单、出货单、调拨单、退货单、损毁单、盘点单和批次入库单编号的序列---------------------------
  ----针对表SALE_TRANSFER_BILL(调拨单)的STB_NO字段创建同一序列函数
  ----add by dzg: 2015-9-11 
/**************************************************************************************************************************/
CREATE OR REPLACE FUNCTION f_get_sale_transfer_bill_seq
   RETURN VARCHAR2 IS
BEGIN
   return 'DB'||lpad(seq_order_no.nextval,8,'0');
END;
